<?php
include("auth.php");
?>
<!DOCTYPE html>
<html>
     <head>
         <meta charset="utf-8">
         <title>Math4YOU</title>
         <link rel="stylesheet" href="css/style.css" />
     </head>
     <body>
          <div>           
            <div class="head">
                  <p id="math" align="center">Математический форум</p>
            </div>
            <div class="user">
             <p>Пользователь: <?php echo $_SESSION['username']; ?></p>
             <p><a href="dashboard.php">Ваш профиль</a></p>
             <a href="logout.php">Выйти</a>
            </div>
          </div>  
            <div class="links">ссылки</div>
            <div class="big">
                <div align="center">
                    <h1>Главная страница</h1>
                    <h2>Как появилась математика: основы и история развития науки. Роль математики в жизни и интересные факты.</h2>
                </div>
                <div align="center"><img class="img" src="css/img1.jpg"></div>
                 Математика – точная дисциплина, которую называют царицей всех наук. Принято считать, что первые числа появились тысячи лет тому назад, вместе с речью. По этому поводу Ф. Энгельс писал, что самый древний источник математических знаний – это пальцы рук. Среди самых древних математических документов, дошедших до наших дней, считают записи вавилонян. По оценкам ученых, они сделаны более восьми тысяч лет назад. Математические записи встречаются и у других народов. Так как появилась математика, и кто ее придумал?
                <div align="center"><img class="img" src="css/img2.jpg"></div>
                <h2 align="center">История</h2>
                Никто точно не может сказать, как появилась математика. Сведения о ней содержатся в разных письменах у различных народов. Самые древние сведения, дошедшие до наших дней – клинописные таблички. Найденные артефакты эпохи Вавилона показывают, что даже шесть тысяч лет тому назад люди вели подсчеты домашних расходов, торговых сделок, решали математические задачки. Позже вавилоняне начали решать сложные алгебраические задачки, кубические и квадратные вычисления. А как появилась математика с дробями, когда это было? Такие сложные действия люди научились вычислять не сразу, однако уже в Древнем Египте умели проводить вычисления с дробями, у которых в числительном была единица. Десятичные дроби появились благодаря самаркандскому математику Д. ибо-Самосуд аль-Каши пятьсот лет назад. Спустя почти два столетия фламандский математик Стивен ввел их в Европе. Даже сегодня в математике совершаются различные открытия. Это связано с тем, что математика – наука, которая не стоит на месте, а постоянно движется вперед.
                <div align="center"><img class="img" src="css/img3.jpg"></div>
                <h2 align="center">Становление науки</h2>
                С тех пор, как появилась математика, люди стали более разумными. В давние времена счет был нужен для занятия всеми видами деятельности. Математику применяли в скотоводстве, торговле. Чтобы было удобнее пользоваться счетом, применяли части тела: пальцы рук, ног. Об этом свидетельствуют древние наскальные рисунки, которые изображают числа в виде определенного количества изображенных пальцев рук.
                <h2 align="center">Первые открытия</h2>
                Многие ученые пытаются разгадать загадку истории – как появилась математика. Однако точную дату возникновения науки никто не может назвать. Среди всех существующих открытий, самое значимое – изобретение самого числа и четырех основных действий: сложения, вычитания, деления и умножения. Среди геометрических понятий, первыми достижениями стали прямая и окружность. Далее огромный вклад в развитие науки внесли вавилоняне и египтяне примерно три тысячи лет назад. Исходя из этого, отвечая на вопрос, где появилась математика, можно сказать, что она зародилась в Вавилоне, а затем в Египте. Сохранившиеся таблички показывают, какие вычисления проводились в те времена.
                <div align="center"><img class="img" src="css/img4.jpg"></div>
                <h2 align="center">Наука в Вавилоне и Египте</h2>
                В Вавилоне, откуда появилась математика, постоянно разрабатывались исследования, в которых применялись единицы и десятки. Именно вавилонские ученые придумали градусы, разрабатывались системы исчисления. Однако в вавилонской системе не было нуля, из-за чего обозначение некоторых чисел было сложным. В Египте числа обозначались в виде иероглифов. До семнадцатого века математика считалась наукой, которая изучает числа, геометрические фигуры, величины. Ее применяли в торговле, астрономии, архитектуре, при проведении земляных работ. И только с восемнадцатого столетия она начала свое бурное развитие.
                <h2 align="center">История о математике</h2>
                Ученые все еще задаются вопросом, в какой стране появилась математика. Есть свидетельства, показывающие, что простые измерения проводились у инков. Этот народ разработал особую узелковую систему счета, которая позволяла вести подсчеты доходов и расходов. Из Древнего Египта до нас дошли тексты решения задач. Египтяне знали дроби, проводили расчеты площадей, объемов. Одному из документов более четырех тысяч лет – это папирус Ринда. Из библиотеки Ашшурбанипала до нас дошли глиняные таблички. Междуречье считалось высокоразвитым. Здесь даже математика была более высокого уровня, чем в других странах. Не малый вклад в развитие науки сделали древние греки. Около трехсотого года до нашей эры, Евклидий создал манускрипт, посвященный геометрии. Позже вклад в науку внесли другие ученые. В Китае, примерно в двухсотом году до нашей эры, изучали математику по «Арифметике в девяти главах». Это писание было составлено на основе ранних записей.
                <div align="center"><img height="500px" class="img" src="css/img5.jpg"></div>
                <h2 align="center">Интересные факты</h2>
                Ниже представлено краткое содержание, как появилась математика, какие с ней связаны интересные факты. Оказывается, что эта наука еще сложнее, чем кажется.
                <ol>
                    <li>Вся наука математики умещается в 100 000 книг.</li>
                    <li>Первая женщина-математик – Гипатия, жившая в Древней Византии еще за 500 лет до нашей эры.</li>
                    <li>Самое загадочное число, с которым связано не только множество математических открытий, но и религиозных писаний – 666.</li>
                    <li>парламенте Европы имеется кресло с номером 666, которое всегда пустое.</li>
                    <li>По всему миру все объекты, которые попадают под номер 666, заменяются на другие цифры. Так, в мире не существует трасс с номером 666, маршруток, кодов телефонов.</li>
                    <li>Самые первые найденные математические свидетельства были обнаружены в Свазиленде. На кости бабуинов выбиты черточки. Возраст данной находки более 40 000 лет.</li>
                    <li>У каждого народа есть свое суеверное число. В России – это 13, а в Китае – 4, причем, у китайцев нет квартир с этим номером, в лифте нет четвертого этажа. В Италии не любят 17.</li>
                    <li>Самые счастливые и популярные цифры по результатам опроса – это 7 и 3. Такие результаты не удивительны, ведь в древней религии с числом 7 связана положительная энергетика.</li>
                    <li>Самое большое число в мире – это центилион. У него на конце 600 нулей.</li>
                    <li>Самое малое число, известное ученым, даже не получило название. Это десятичная дробь, у которой после запятой перед единицей стоит сто миллионов триллионов триллионов нулей. Эта цифра не используется математиками, но применяется астрономами при расчетах вероятности формирования новой Вселенной из атома.</li>
                </ol>
                <div align="center"><img class="img" src="css/img6.jpg"></div>
                <h2 align="center">Математика в жизни</h2>
                Ежедневно люди применяют математику и даже не догадываются, что с этой наукой связано много интересного. Когда-то в Англии жил ученый А. де Муавр. Его заинтересовал факт увеличения продолжительности сна. Ученый заметил, что его сон увеличивается на пятнадцать минут. Как математику, ему стало интересно, к чему это может привести. Ученый подсчитал, когда его сон будет занимать 24 часа. Эта дата выпала на 27 ноября 1754 г. – дату его смерти. В российских школах число ноль не считается натуральным, а вот в западных – оно относится к множеству натуральных чисел. Математики всегда пытаются выполнять с цифрами различные действия, даже играя в казино. Оказывается, если сложить все цифры рулетки, то сумма будет 666. В истории много занимательных математических фактов. К примеру, число пи стали использовать еще в шестом веке до нашей эры, квадратные уравнения появились в Индии в VI веке нашей эры. Древнегреческие ученые писали труды, посвященные математике, на десятки томов. Их работы до сих пор используются учеными.
                <div align="center"><img id="bad_img" src="css/img7.jpg"></div>
            <div class="float">подвал</div>    
     </body>
</html>
